#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_cloudwatch_log_group.vpc_flow_logs: Refreshing state... [id=/aws/vpc/flow-logs]
aws_kms_key.cloudwatch: Refreshing state... [id=b19e4b55-704d-45b2-b42d-3047ce6ec1d5]
data.aws_ami.ubuntu: Reading...
data.aws_ssm_parameter.ssh_key: Reading...
aws_vpc.main: Refreshing state... [id=vpc-0f952cfa9a8c3a122]
aws_iam_role.ssm_role: Refreshing state... [id=rs-bastion-ssm-role-dev]
aws_iam_policy.ssm_cert_read_policy: Refreshing state... [id=arn:aws:iam::767398122881:policy/rs-ssm-cert-read-policy-dev]
aws_iam_role.vpc_flow_logs_role: Refreshing state... [id=rs-vpc-flow-logs-role-dev]
aws_eip.nat: Refreshing state... [id=eipalloc-0c23a21f6730be6d5]
aws_iam_instance_profile.ssm_profile: Refreshing state... [id=rs-bastion-instance-profile-dev]
aws_iam_role_policy_attachment.ssm_attach: Refreshing state... [id=rs-bastion-ssm-role-dev-20250625222840416700000001]
aws_iam_role_policy_attachment.vpc_flow_logs_policy: Refreshing state... [id=rs-vpc-flow-logs-role-dev-20250625222840453800000002]
data.aws_ssm_parameter.ssh_key: Read complete after 0s [id=/development/KEYPAIR]
local_file.ssh_key: Refreshing state... [id=4edc0d98a397011e99505d24aad17357304656d0]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-0d4d7e98021b6b9a6]
aws_subnet.public[1]: Refreshing state... [id=subnet-0b37aea4c20a84fe1]
aws_subnet.private[1]: Refreshing state... [id=subnet-0db540ca0bf2e3e9e]
aws_flow_log.vpc_flow: Refreshing state... [id=fl-040ca0abd913d853c]
aws_subnet.private[0]: Refreshing state... [id=subnet-07d7d591f5d06f763]
aws_subnet.public[0]: Refreshing state... [id=subnet-034a97513d5d4746c]
aws_internet_gateway.igw: Refreshing state... [id=igw-0d4b927d85c7fb164]
aws_security_group.bastion_sg: Refreshing state... [id=sg-050ccffbf8cf0d67f]
aws_security_group.vm_public_sg: Refreshing state... [id=sg-0e251e76f45253aef]
aws_route_table.public: Refreshing state... [id=rtb-08355ce9b659d9a54]
aws_nat_gateway.natgw: Refreshing state... [id=nat-0fcbb1e32471f0cb9]
aws_network_acl.public: Refreshing state... [id=acl-05212764b4b94aa4b]
aws_security_group.vm_private_sg: Refreshing state... [id=sg-097286ad4dd39a020]
aws_instance.bastion: Refreshing state... [id=i-0edb45ee17c65d7c0]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-08d22ab3c3556717c]
aws_network_acl.private: Refreshing state... [id=acl-052fa174d90597498]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-01ad0d6a435ae6abf]
aws_route_table.private: Refreshing state... [id=rtb-06fdb6de202fe1c8c]
aws_network_acl_rule.public_outbound_all: Refreshing state... [id=nacl-3720958439]
aws_network_acl_rule.public_inbound_all: Refreshing state... [id=nacl-1701674263]
aws_instance.k3s_worker: Refreshing state... [id=i-05752995b4429e6d6]
aws_instance.k3s_control_plane: Refreshing state... [id=i-08c77f0edf6dd4c5b]
aws_network_acl_rule.private_inbound_icmp_vpc: Refreshing state... [id=nacl-4050057706]
aws_network_acl_rule.private_outbound_all: Refreshing state... [id=nacl-88704026]
aws_network_acl_rule.private_inbound_all_vpc: Refreshing state... [id=nacl-2797171555]
aws_network_acl_rule.private_inbound_ephemeral: Refreshing state... [id=nacl-1216248323]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0cc5f642c5b67691e]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0fdad5ad8d181f0f2]
null_resource.provision_k3s_control_plane: Refreshing state... [id=696710617322676469]
null_resource.provision_k3s_worker: Refreshing state... [id=5830355204001493362]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # local_file.ssh_key will be created
  + resource "local_file" "ssh_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "./blackbird.pem"
      + id                   = (known after apply)
    }

  # null_resource.provision_k3s_worker is tainted, so must be replaced
-/+ resource "null_resource" "provision_k3s_worker" {
      ~ id = "5830355204001493362" -> (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "output.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @isbelevtsov, Action: `pull_request`, Working Directory: `task_3/project`, Workflow: `Terraform Plan and Apply`*